; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
(define (problem floortile-34)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_0_4
    tile_1_1
    tile_1_2
    tile_1_3
    tile_1_4
    tile_2_1
    tile_2_2
    tile_2_3
    tile_2_4
    tile_3_1
    tile_3_2
    tile_3_3
    tile_3_4
    tile_4_1
    tile_4_2
    tile_4_3
    tile_4_4
    tile_5_1
    tile_5_2
    tile_5_3
    tile_5_4 - tile
    robot1 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_0_3)
    (robot-has robot1 white)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_4)
    (clear tile_1_1)
    (clear tile_1_2)
    (clear tile_1_3)
    (clear tile_1_4)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_2_4)
    (clear tile_3_1)
    (clear tile_3_2)
    (clear tile_3_3)
    (clear tile_3_4)
    (clear tile_4_1)
    (clear tile_4_2)
    (clear tile_4_3)
    (clear tile_4_4)
    (clear tile_5_1)
    (clear tile_5_2)
    (clear tile_5_3)
    (clear tile_5_4)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_1_4 tile_0_4 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_2_4 tile_1_4 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_3_4 tile_2_4 )
    (up tile_4_1 tile_3_1 )
    (up tile_4_2 tile_3_2 )
    (up tile_4_3 tile_3_3 )
    (up tile_4_4 tile_3_4 )
    (up tile_5_1 tile_4_1 )
    (up tile_5_2 tile_4_2 )
    (up tile_5_3 tile_4_3 )
    (up tile_5_4 tile_4_4 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_0_4 tile_1_4 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_1_4 tile_2_4 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_2_4 tile_3_4 )
    (down tile_3_1 tile_4_1 )
    (down tile_3_2 tile_4_2 )
    (down tile_3_3 tile_4_3 )
    (down tile_3_4 tile_4_4 )
    (down tile_4_1 tile_5_1 )
    (down tile_4_2 tile_5_2 )
    (down tile_4_3 tile_5_3 )
    (down tile_4_4 tile_5_4 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_0_3 tile_0_4 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_1_3 tile_1_4 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_2_3 tile_2_4 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_3_3 tile_3_4 )
    (left tile_4_1 tile_4_2 )
    (left tile_4_2 tile_4_3 )
    (left tile_4_3 tile_4_4 )
    (left tile_5_1 tile_5_2 )
    (left tile_5_2 tile_5_3 )
    (left tile_5_3 tile_5_4 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_0_4 tile_0_3 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_1_4 tile_1_3 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_2_4 tile_2_3 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_3_4 tile_3_3 )
    (right tile_4_2 tile_4_1 )
    (right tile_4_3 tile_4_2 )
    (right tile_4_4 tile_4_3 )
    (right tile_5_2 tile_5_1 )
    (right tile_5_3 tile_5_2 )
    (right tile_5_4 tile_5_3 ))
 (:goal (and 
(painted tile_5_1 white)
(painted tile_4_1 black)
(painted tile_3_1 white)
(painted tile_2_1 black)
(painted tile_1_1 white)
(painted tile_5_2 black)
(painted tile_4_2 white)
(painted tile_3_2 black)
(painted tile_2_2 white)
(painted tile_1_2 black)
(painted tile_5_3 white)
(painted tile_4_3 black)
(painted tile_3_3 white)
(painted tile_2_3 black)
(painted tile_1_3 white)
(painted tile_5_4 black)
(painted tile_4_4 white)
))
)

; plan
1. (move_up robot1 tile_0_3 tile_1_3)
   deleted: (robot-at robot1 tile_0_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_0_3)
   goals met: 0 of 17
2. (move_up robot1 tile_1_3 tile_2_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_1_3)
   goals met: 0 of 17
3. (move_up robot1 tile_2_3 tile_3_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_2_3)
   goals met: 0 of 17
4. (move_up robot1 tile_3_3 tile_4_3)
   deleted: (robot-at robot1 tile_3_3) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_3_3)
   goals met: 0 of 17
5. (paint_up robot1 tile_5_3 tile_4_3 white)
   deleted: (clear tile_5_3)
   added: (painted tile_5_3 white)
   goals met: 1 of 17
6. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 1 of 17
7. (move_right robot1 tile_4_3 tile_4_4)
   deleted: (robot-at robot1 tile_4_3) (clear tile_4_4)
   added: (robot-at robot1 tile_4_4) (clear tile_4_3)
   goals met: 1 of 17
8. (paint_up robot1 tile_5_4 tile_4_4 black)
   deleted: (clear tile_5_4)
   added: (painted tile_5_4 black)
   goals met: 2 of 17
9. (move_left robot1 tile_4_4 tile_4_3)
   deleted: (robot-at robot1 tile_4_4) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_4_4)
   goals met: 2 of 17
10. (move_left robot1 tile_4_3 tile_4_2)
   deleted: (robot-at robot1 tile_4_3) (clear tile_4_2)
   added: (robot-at robot1 tile_4_2) (clear tile_4_3)
   goals met: 2 of 17
11. (paint_up robot1 tile_5_2 tile_4_2 black)
   deleted: (clear tile_5_2)
   added: (painted tile_5_2 black)
   goals met: 3 of 17
12. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 3 of 17
13. (move_left robot1 tile_4_2 tile_4_1)
   deleted: (robot-at robot1 tile_4_2) (clear tile_4_1)
   added: (robot-at robot1 tile_4_1) (clear tile_4_2)
   goals met: 3 of 17
14. (paint_up robot1 tile_5_1 tile_4_1 white)
   deleted: (clear tile_5_1)
   added: (painted tile_5_1 white)
   goals met: 4 of 17
15. (move_down robot1 tile_4_1 tile_3_1)
   deleted: (robot-at robot1 tile_4_1) (clear tile_3_1)
   added: (robot-at robot1 tile_3_1) (clear tile_4_1)
   goals met: 4 of 17
16. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 17
17. (paint_up robot1 tile_4_1 tile_3_1 black)
   deleted: (clear tile_4_1)
   added: (painted tile_4_1 black)
   goals met: 5 of 17
18. (move_right robot1 tile_3_1 tile_3_2)
   deleted: (robot-at robot1 tile_3_1) (clear tile_3_2)
   added: (robot-at robot1 tile_3_2) (clear tile_3_1)
   goals met: 5 of 17
19. (move_right robot1 tile_3_2 tile_3_3)
   deleted: (robot-at robot1 tile_3_2) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_3_2)
   goals met: 5 of 17
20. (paint_up robot1 tile_4_3 tile_3_3 black)
   deleted: (clear tile_4_3)
   added: (painted tile_4_3 black)
   goals met: 6 of 17
21. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 6 of 17
22. (move_right robot1 tile_3_3 tile_3_4)
   deleted: (robot-at robot1 tile_3_3) (clear tile_3_4)
   added: (robot-at robot1 tile_3_4) (clear tile_3_3)
   goals met: 6 of 17
23. (paint_up robot1 tile_4_4 tile_3_4 white)
   deleted: (clear tile_4_4)
   added: (painted tile_4_4 white)
   goals met: 7 of 17
24. (move_left robot1 tile_3_4 tile_3_3)
   deleted: (robot-at robot1 tile_3_4) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_3_4)
   goals met: 7 of 17
25. (move_left robot1 tile_3_3 tile_3_2)
   deleted: (robot-at robot1 tile_3_3) (clear tile_3_2)
   added: (robot-at robot1 tile_3_2) (clear tile_3_3)
   goals met: 7 of 17
26. (paint_up robot1 tile_4_2 tile_3_2 white)
   deleted: (clear tile_4_2)
   added: (painted tile_4_2 white)
   goals met: 8 of 17
27. (move_left robot1 tile_3_2 tile_3_1)
   deleted: (robot-at robot1 tile_3_2) (clear tile_3_1)
   added: (robot-at robot1 tile_3_1) (clear tile_3_2)
   goals met: 8 of 17
28. (move_down robot1 tile_3_1 tile_2_1)
   deleted: (robot-at robot1 tile_3_1) (clear tile_2_1)
   added: (robot-at robot1 tile_2_1) (clear tile_3_1)
   goals met: 8 of 17
29. (paint_up robot1 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 9 of 17
30. (move_right robot1 tile_2_1 tile_2_2)
   deleted: (robot-at robot1 tile_2_1) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_2_1)
   goals met: 9 of 17
31. (move_right robot1 tile_2_2 tile_2_3)
   deleted: (robot-at robot1 tile_2_2) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_2_2)
   goals met: 9 of 17
32. (paint_up robot1 tile_3_3 tile_2_3 white)
   deleted: (clear tile_3_3)
   added: (painted tile_3_3 white)
   goals met: 10 of 17
33. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 17
34. (move_down robot1 tile_2_3 tile_1_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_2_3)
   goals met: 10 of 17
35. (paint_up robot1 tile_2_3 tile_1_3 black)
   deleted: (clear tile_2_3)
   added: (painted tile_2_3 black)
   goals met: 11 of 17
36. (move_left robot1 tile_1_3 tile_1_2)
   deleted: (robot-at robot1 tile_1_3) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_1_3)
   goals met: 11 of 17
37. (move_up robot1 tile_1_2 tile_2_2)
   deleted: (robot-at robot1 tile_1_2) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_1_2)
   goals met: 11 of 17
38. (paint_up robot1 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 12 of 17
39. (move_down robot1 tile_2_2 tile_1_2)
   deleted: (robot-at robot1 tile_2_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_2_2)
   goals met: 12 of 17
40. (move_left robot1 tile_1_2 tile_1_1)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_1)
   added: (robot-at robot1 tile_1_1) (clear tile_1_2)
   goals met: 12 of 17
41. (paint_up robot1 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 13 of 17
42. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 13 of 17
43. (move_down robot1 tile_1_1 tile_0_1)
   deleted: (robot-at robot1 tile_1_1) (clear tile_0_1)
   added: (robot-at robot1 tile_0_1) (clear tile_1_1)
   goals met: 13 of 17
44. (paint_up robot1 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 14 of 17
45. (move_right robot1 tile_0_1 tile_0_2)
   deleted: (robot-at robot1 tile_0_1) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_1)
   goals met: 14 of 17
46. (move_up robot1 tile_0_2 tile_1_2)
   deleted: (robot-at robot1 tile_0_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_0_2)
   goals met: 14 of 17
47. (paint_up robot1 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 15 of 17
48. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 15 of 17
49. (move_down robot1 tile_1_2 tile_0_2)
   deleted: (robot-at robot1 tile_1_2) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_1_2)
   goals met: 15 of 17
50. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 16 of 17
51. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 16 of 17
52. (move_right robot1 tile_0_2 tile_0_3)
   deleted: (robot-at robot1 tile_0_2) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_0_2)
   goals met: 16 of 17
53. (paint_up robot1 tile_1_3 tile_0_3 white)
   deleted: (clear tile_1_3)
   added: (painted tile_1_3 white)
   goals met: 17 of 17
